app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sublime Text 3"], ["description", "A text editor for everyone"], ["created_at", "2017-07-06 01:04:53.569989"], ["updated_at", "2017-07-06 01:04:53.569989"]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Sublime Text 4 beta"], ["description", ""], ["updated_at", "2017-07-08 05:11:43.722911"], ["id", 1]]